zoujixing/nRF51_Arduino_S130/Arduino1.6.x/hardware/RBL/RBL_nRF51822/cores/RBL_nRF51822/Arduino.h
/*
  Copyright (c) 2012 Arduino.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef Arduino_h
#define Arduino_h

#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>

// some libraries and sketches depend on this
// AVR stuff, assuming Arduino.h or WProgram.h
// automatically includes it..
#include <avr/pgmspace.h>

#include "binary.h"

#ifdef __cplusplus
extern "C"{
#endif 

// Includes Atmel CMSIS
#include "app_util_platform.h"
#include "nrf.h"
#include "startup_nrf51822.h"
#include "nrf_gpiote.h"
#include "nrf_gpio.h"
#include "wiring_constants.h"
#include "app_timer.h"
#include "app_error.h"

#define countof(x) 					 (sizeof(x)/sizeof(x[0]))

#define VARIANT_MCK         		 16000000UL	

#define clockCyclesPerMicrosecond()  ( VARIANT_MCK / 1000000L )
#define clockCyclesToMicroseconds(a) ( (a) / clockCyclesPerMicrosecond() )
#define microsecondsToClockCycles(a) ( (a) * clockCyclesPerMicrosecond() )

void yield(void);

#include "pins_arduino.h"

#include "delay.h"
#include "wiring_digital.h"
#include "wiring_analog.h"
#include "wiring_shift.h"
#include "pin_transform.h"

/* sketch */
extern void setup( void ) ;
extern void loop( void ) ;

#ifdef __cplusplus
} 

#include "WString.h"
#include "Tone.h"
#include "WMath.h"
#include "HardwareSerial.h"
#include "wiring_pulse.h"
#include "wiring_interrupt.h"
#include "wuart.h"

#endif 

#endif 
